common/ASC.Identity/api/artillery.yml
config:
  target: http://authorization.io
  environments:
    staging:
      target: "http://127.0.0.1:9090"
      phases:
        - duration: 120
          arrivalRate: 1
          rampTo: 10
          name: Warm up phase
        - duration: 180
          arrivalRate: 10
          rampTo: 50
          name: Ramp up load
        - duration: 60
          arrivalRate: 50
          rampTo: 100
          name: Spike phase
    development:
      target: "http://127.0.0.1:9090"
      phases:
        - duration: 120
          arrivalRate: 1
          rampTo: 10
          name: Warm up phase
        - duration: 180
          arrivalRate: 10
          rampTo: 50
          name: Ramp up load
        - duration: 60
          arrivalRate: 50
          rampTo: 100
          name: Spike phase
  defaults:
    headers:
      X-API-Version: 1
  plugins:
    ensure:
      thresholds:
        - "http.response_time.p99": 2500
        - "http.response_time.p95": 1500
    metrics-by-endpoint:
      useOnlyRequestNames: true
      metricsNamespace: "latency_metrics"
    apdex: {}
scenarios:
  - name: "GET requests"
    flow:
      - loop:
          - get:
              url: "/api/clients"
              headers:
                X-Tenant: 1
              qs:
                page: 0
                limit: 25
          - get:
              url: "/api/scopes"
              qs:
                page: 0
                limit: 25
        count: 1000
#  - name: "POST requests"
#    flow:
#      - loop:
#          - post:
#              url: "/api/clients"
#              headers:
#                X-Tenant: 1
#              json:
#                name: "Artillery App"
#                description: "Artillery App Description"
#                terms_url: "http://127.0.0.1:9090/terms"
#                policy_url: "http://127.0.0.1:9090/policy"
#                logo_url: "http://127.0.0.1:9090/logo"
#                authenticationMethod: "client_secret_post"
#                redirect_uri: "http://127.0.0.1:9090/authorized"
#                logout_redirect_uri: "http://127.0.0.1:9090/logout"
#                scopes: [ "accounts:read", "accounts:write" ]
#        count: 100